Tekla Open API Reference for Tekla Structures 2025
BaseComponent.CUSTOM_OBJECT_NUMBER Field
 The component number to be used when calling a custom component.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const int CUSTOM_OBJECT_NUMBER = -1
Public Const CUSTOM_OBJECT_NUMBER As Integer = -1
Field Value
Type: Int32
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace